

handlers_dict = {
    "start": "Главное меню\n\n"
             "Выберите один из вариантов предложенных ниже\n\n"
             "Доп информация:\n"
             "Команда /start - перезапустит бота\n"
             "Команда /info - вызовет подробную инструкцию для бота",

    "info": "Тут можно подробно расписать, как пользоваться ботом и рассписать как бот будет искать "
            "предложения по сайту",

    "add_word_first": "Введите слово на рус",
    "add_word_last": "Введите слово на eng",
    "add_word_quit": " Вы хотите добавить еще одно слово ?",

    "add_phrase_first": "Введите фразу на рус",
    "add_phrase_last": "Введите фразу на eng",
    "add_phrase_quit": "Вы хотите добавить еще одну фразу ?",

    "start_test_word": "Выберите период за который хотите пройти тест и режим отображения слов.\n?",
    "start_test_phrase": " Выберите период за который хотите пройти тест и режим отображения фраз.\n?",



    "user_settings": "Тут настраиваеться:\n"
                     "1 - Количество вопросов при прохождении теста.\n"
                     "2 - Минимальный уровень процента, который учитывается при подсчете прохождения теста.\n\n"
                     "Стандартное значение для вопросов - 10, минимальный процент - 70%. При данных настройках тест будет считаться положительным,"
                     "если процент Ваших ошибок не будет превышать 30% от стандартных 10 слов в тесте.\n"
                     "Если Вы хотите изменить настройки выбери один из вариантов ниже и укажите необходимое для Вас значение.",


    "user_settings_update_q": "Укажите желаемое количество вопросов :",
    "user_settings_update_%": "Укажите желаемый процент ошибок, от 0 до 100 :",

    "user_settings_update_accept_q": "Настройки сохранены. Количество вопросов при тесте будет",
    "user_settings_update_accept_%": "Настройки сохранены. Минимальный процент правильных ответов будет"
}

