

handlers_dict = {
    "start": "Главное меню\n\n"
             "Выберите один из вариантов предложенных ниже\n\n"
             "Доп информация:\n"
             "Команда /start - перезапустит бота\n"
             "Команда /info - вызовет подробную инструкцию для бота",

    "info": "Тут можно подробно расписать, как пользоваться ботом и рассписать как бот будет искать "
            "предложения по сайту",

    "add_word_first": "Введите слвоо на рус",
    "add_word_last": "Введите слвоо на eng",
    "add_word_replay": f" Вы хотите добавить еще одно слово ?",
}

