

handlers_dict = {
    "start": "Главное меню\n\n"
             "Выберите один из вариантов предложенных ниже\n\n"
             "Доп информация:\n"
             "Команда /start - перезапустит бота\n"
             "Команда /info - вызовет подробную инструкцию для бота",

    "info": "Тут можно подробно расписать, как пользоваться ботом и рассписать как бот будет искать "
            "предложения по сайту",

    "add_word_first": "Введите слово на рус",
    "add_word_last": "Введите слово на eng",
    "add_word_quit": f" Вы хотите добавить еще одно слово ?",

    "add_phrase_first": "Введите фразу на рус",
    "add_phrase_last": "Введите фразу на eng",
    "add_phrase_quit": f"Вы хотите добавить еще одну фразу ?",

    "start_test_word": f" Выберите период за который хотите пройти тест и режим отображения слов.\n?",
    "start_test_phrase": f" Выберите период за который хотите пройти тест и режим отображения фраз.\n?"
}

