

handlers_dict = {
    "start": "Главное меню\n\n"
             "Выберите один из вариантов предложенных ниже\n\n"
             "Доп информация:\n"
             "Команда /start - перезапустит бота\n"
             "Команда /info - вызовет подробную инструкцию для бота",

    "info": "Тут можно подробно расписать, как пользоваться ботом и расписать как бот будет искать "
            "предложения по сайту",

    "add_word_first": "Введите слово на рус",
    "add_word_last": "Введите слово на eng",
    "add_word_quit": " Вы хотите добавить еще одно слово ?",

    "add_phrase_first": "Введите фразу на рус",
    "add_phrase_last": "Введите фразу на eng",
    "add_phrase_quit": "Вы хотите добавить еще одну фразу ?",

    "start_test_word_1": "Начало теста",
    "start_test_word_2": "Выберите период за который хотите пройти тест и режим отображения слов.\n?",
    "start_test_phrase": "Выберите период за который хотите пройти тест и режим отображения фраз.\n?",
    "replay_word": "Нажимайте на слово под этим сообщением, для появления следующей пары",



    "user_settings": "Тут настраивается:\n"
                     "1 - Количество вопросов при прохождении теста.\n"
                     "2 - Минимальный уровень процента, который учитывается при подсчете прохождения теста.\n"
                     "3 - Период за который буду предоставляться слова для теста.\n"
                     "4 - При режиме добавления слова можно настроить на каком языке первым будет спрашиваться слово,"
                     "на rus или Eng.\n\n"
                     "Стандартное значение для вопросов - 3, минимальный процент - 50%. "
                     "При данных настройках тест будет считаться положительным,"
                     "если процент Ваших ошибок не будет превышать 50% от стандартных 3 слов в тесте.\n\n"
                     "Если Вы хотите изменить настройки выбери один из вариантов ниже и укажите необходимое "
                     "для Вас значение.\nВаши настройки будут отображаться ниже\n⬇️⬇️⬇️",


    "user_settings_update_q": "Укажите желаемое количество вопросов :",
    "user_settings_update_%": "Укажите желаемый процент ошибок, от 0 до 100 :",
    "user_settings_update_d": "Укажите желаемое количество дней :",
    "user_settings_update_a": "Укажите на каком языке будет спрашиваться первое слово :",

    "user_settings_update_accept_q": "Настройки сохранены. Количество вопросов при тесте будет",
    "user_settings_update_accept_%": "Настройки сохранены. Минимальный процент правильных ответов будет",
    "user_settings_update_accept_d": "Настройки сохранены. Количество дней при использовании теста будет",
    "user_settings_update_accept_a": "Настройки сохранены. Язык на котором будет запрашиваться первое слово"
}
